# CircuitNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..CircuitNumber Property
ElectricalSystem Class See Also
---
The CircuitNumber of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string CircuitNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CircuitNumber As String
	Get
```

Visual C++
---
```text
public:
property String^ CircuitNumber {
	String^ get ();
}
```

# Remarks
This property is used to retrieve the CircuitNumber of the Electrical System.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace